DataProcessors/ОбновлениеМаркеровПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ОбновлениеМаркеровПоставщиков</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркерТекущий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркерНовый</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Закупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Закупки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВозвратыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ВозвратыПоставщикам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоВинеПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/МаркерыРискаПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>МаркерыРискаПоставщиков</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МаркерРиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ОбновлениеМаркеровПоставщиков/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВычислитьЗначенияМаркеров(Команда)
	ВычислитьЗначенияМаркеровНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВычислитьЗначенияМаркеровНаСервере()
	Объект.СписокКонтрагентов.Очистить();
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакупкиОбороты.Поставщик КАК Поставщик,
		|	СУММА(ЗакупкиОбороты.СуммаОборот) КАК СуммаЗакупок
		|ПОМЕСТИТЬ ВТ_Закупки
		|ИЗ
		|	РегистрНакопления.Закупки.Обороты(&НачПериод, &КонПериод, Месяц, ) КАК ЗакупкиОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗакупкиОбороты.Поставщик
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЗакупкиОбороты.СуммаОборот) > &МинЗнач
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратыПоставщикам.Поставщик КАК Поставщик,
		|	ВозвратыПоставщикам.Сумма КАК СуммаВозврата
		|ПОМЕСТИТЬ ВТ_Возвраты
		|ИЗ
		|	РегистрНакопления.ВозвратыПоставщикам КАК ВозвратыПоставщикам
		|ГДЕ
		|	ВозвратыПоставщикам.ПоВинеПоставщика = &Истина
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Закупки.Поставщик КАК Поставщик,
		|	ВТ_Закупки.СуммаЗакупок КАК СуммаЗакупок,
		|	ЕСТЬNULL(СУММА(ВТ_Возвраты.СуммаВозврата), 0) КАК СуммаВозврата
		|ИЗ
		|	ВТ_Закупки КАК ВТ_Закупки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Возвраты КАК ВТ_Возвраты
		|		ПО ВТ_Закупки.Поставщик = ВТ_Возвраты.Поставщик
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Закупки.Поставщик,
		|	ВТ_Закупки.СуммаЗакупок";
	
	//ПрошлыйМесяц = ДобавитьМесяц(ТекущаяДата(), -1); 
	ВыбранныйПериод = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("НачПериод", НачалоГода(ВыбранныйПериод));
	Запрос.УстановитьПараметр("КонПериод", КонецГода(ВыбранныйПериод));
	Запрос.УстановитьПараметр("МинЗнач", Константы.МинСуммаДляВычисленияМаркераРиска.Получить());
	Запрос.УстановитьПараметр("Истина", Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.СписокКонтрагентов.Добавить();
		НовСтр.Контрагент = ВыборкаДетальныеЗаписи.Поставщик;
		
		НаборЗаписей = РегистрыСведений.МаркерыРискаПоставщиков.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Поставщик.Установить(ВыборкаДетальныеЗаписи.Поставщик);
		НаборЗаписей.Прочитать(); 
		
		ЕстьЗапись = Ложь;
		Для Каждого Запись Из НаборЗаписей Цикл
			ЕстьЗапись = Истина;
			НовСтр.МаркерТекущий = Запись.МаркерРиска; 			
		КонецЦикла;
		
		Если НЕ ЕстьЗапись Тогда
			НовСтр.МаркерТекущий = "<не установлен>";
		КонецЕсли;		

		Процент = ВыборкаДетальныеЗаписи.СуммаВозврата / ВыборкаДетальныеЗаписи.СуммаЗакупок * 100;
		Если Процент > Константы.КрасныйМаркерРиска.Получить() Тогда
			НовСтр.МаркерНовый = "красный";
		ИначеЕсли Процент > Константы.ЖелтыйМаркерРиска.Получить() Тогда
			НовСтр.МаркерНовый = "желтый";
		Иначе
			НовСтр.МаркерНовый = "зеленый"; 
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА    
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗначенияМаркеров(Команда)
	ЗаписатьЗначенияМаркеровНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначенияМаркеровНаСервере()	
	Для Каждого ТекСтрока Из Объект.СписокКонтрагентов Цикл 	 
		МенеджерЗаписи = РегистрыСведений.МаркерыРискаПоставщиков.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Поставщик = ТекСтрока.Контрагент;
		МенеджерЗаписи.МаркерРиска = ТекСтрока.МаркерНовый;
		МенеджерЗаписи.Записать();
	КонецЦикла;
КонецПроцедуры
